Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Изменения касаются всех узлов, в процессе которых происходит формирование или разбор xml документа по схеме: Импорт XML файла, Экспорт в XML, Извлечение XML, Формирование XML, SOAP-запрос.
en: The changes concern all nodes in the process of which generation or parsing of xml document is performed according to the schema: XML file import, Export to XML, XML extraction, XML generation, SOAP request.

source: Изменения коснулись преимущественно технологического стека платформы и связаны с системными вызовами и библиотеками, сторонними библиотеками, работой со строками и различными интеграциями.
en: The changes affected mostly the technologic platform stack and they are connected with system challenges and libraries, third-party libraries, operations with rows and different integrations.

source: Изменились системные требования для Loginom под Linux.
en: Loginom system requirements changed for Linux.

source: Изменился текст сообщения, которое выводится во время длительной подготовки визуализатора (например, при входе в визуализатор Статистика или Куб, когда в момент активации выполняются вычисления).
en: Text of the message that is displayed during the long visualizer preparation was changed (for example, when entering Statistics or Cube visualizer when calculations are performed at the moment of activation).

source: Изменился файл конфигурации Loginom Integrator:
en: Loginom Integrator configuration file was changed:

source: Изменился формат ответных SOAP-сообщений для старых пакетов, созданных до версии 6.3.0.
en: Format of response SOAP messages was hanged for old packages created before version 6.3.0.

source: Изменился формат элемента configSections:
en: configSections element format was changed:

source: Иконка узла подмодели на панели подключений заменена на индивидуальную иконку папки, что исключает путаницу (#8049).
en: The supernode node icon of the connection bar was replaced with the individual folder icon that excludes the confusion (#8049).

source: Импорт из LGD-файлов, Экспорт в LGD-файлы
en: Import from LGD Files, Export to LGD Files

source: Импорт из Баз данных в Loginom
en: Import from Databases in Loginom

source: Импорт из текстового файла
en: Import from the Text File

source: Импорт из файлов
en: Import from Files

source: Имя файла web.config заменено на Integrator.dll.config.
en: web.config file name was replaced with Integrator.dll.config.

source: Иногда возникают ситуации, когда различия в функционалах нужно учитывать при проектировании сценариев.
en: Sometimes there are situations when it is required to take into account the functionality differences when designing workflows.

source: Интеграция с брокером сообщений Kafka
en: Integration with Kafka Message Broker

source: Исключается возможность закрепления панели в правой области.
en: Possibility of bar locking in the right area is excluded.

source: Использование диалога KDE может быть отключено переменной окружения NO_LOGINOM_KDE_FILE_DIALOG.
en: KDE dialog use can be disabled by the variable of NO_LOGINOM_KDE_FILE_DIALOG environment.

source: Использование скриптов на языке Python
en: Use of the Python based scripts

source: Использование языков программирования
en: Programming Languages Use

source: Исправили ошибки, возникавшие при работе с базами данных, визуализаторами, компонентами Калькулятор, JavaScript и Python.
en: The errors occurring when working with databases, visualizers, Calculator, JavaScript and Python components were corrected.

source: Исправили ошибочное поведение (#7566).
en: Error of behavior was corrected (#7566).

source: Исправили поведение, теперь в подобной ситуации при закрытии сессии из Диспетчера в столбце Активность отображается надпись «Удаляется», а после восстановления соединения (выхода из спящего режима) клиент получит сообщение «Администратор закрыл сессию через диспетчер».
en: Error of behavior was corrected. Now in this situation when closing the session from the Session Manager, "Deleted" is displayed in Activity column, and after restoration of connection (wake from sleep) the client receives the following message: "Administrator closed the session via the Session Manager".

source: Исправлен откат транзакций (#8103).
en: Transactions roll back was corrected (#8103).

source: Исправлен пакетный экспорт в базу данных Firebird строк длиной 9 и более символов в поля с типом BLOB SUB_TYPE TEXT.
en: The package export of the strings with the length of 9 and more characters to the fields of BLOB SUB_TYPE TEXT type to the Firebird database was corrected.

source: Исправлен расчёт статистики, теперь она считается для каждой группы (#5221).
en: The statistics calculation was corrected. Now, it is calculated for each group (#5221).

source: Исправлена логика восстановления ссылки на пакет.
en: The logics of restoring reference to the package was corrected.

source: Исправлена ошибка «столбец "value" имеет тип money, а выражение - double precision», возникавшая при попытке экспорта вещественных чисел в поле money базы данных PostgreSQL.
en: The following error was corrected: "value" column relates to the money type, and expression - double precision". It occurred while trying to export real numbers to the money field of the PostgreSQL database.

source: Исправлена ошибка «столбец "value" имеет тип time with time zone, а выражение - timestamp without time zone», возникавшая при попытке экспорта значения типа Дата/Время в поле time with timezone базы данных PostgreSQL.
en: The following error was corrected: "value" column relates to the time with time zone type, and expression - timestamp without time zone". It occurred while trying to export the values of the Date/Time type to the time with timezone field of the PostgreSQL database.

source: Исправлена ошибка в обработчике Цикл.
en: The Loop Handler error was corrected.

source: Исправлена ошибка удаления нулей в начале строковых полей при экспорте из Куба в Excel.
en: Error of zeros removing at the beginning of string fields when exporting from the Cube to Excel was corrected.

source: Исправлена работа Python с модулем numexpr в режиме выполнения кода внутри процесса, устранены ошибки, возникавших при выполнении запросов к базам данных, регрессионные ошибки в нескольких обработчиках.
en: The Python operation with numexpr module was corrected in the code execution mode inside the process, errors occurring while executing requests to databases were corrected, regression bugs in several handlers were eliminated.

source: Исправлена работа SOAP-сервисов и подключений к базам данных.
en: Operation of SOAP services and connections to databases was corrected.

source: Исправлена работа разбиения на обучающие и тестовые множества обработчиков и кросс-валидации в регрессиях, что исключает данную ошибку (#9080).
en: The operation of partitioning to the training and test sets of handllers and cross validation in regressions was corrected. It excludes this error (#9080).

source: Исправление ошибки делает порядок полей на выходе узла одинаковым на всех итерациях Цикла, что исключает ошибки при обработке данных (#9103).
en: Correction of this error provides the same field order at the node output for all Loop iterations that excludes errors while data processing (#9103).

source: Исправление ошибки позволяет писать сложные процедурные запросы без ограничений (#8731).
en: Correction of this error enabled to write complicated procedural requests without restrictions (#8731).

source: Исправление ошибок
en: Fixes

source: Исправления исключают эту ошибку (#9042, #9044).
en: Corrections exclude this error (#9042, #9044).

source: Исправлено (#8904).
en: Corrected (#8904).

source: Исправлено (#8963).
en: Corrected (#8963).

source: Исправлено (#9053).
en: Corrected (#9053).

source: Исправлено (#9078).
en: Corrected (#9078).

source: Исправлено (#9082).
en: Corrected (#9082).

source: Исправлено (#9123).
en: Corrected (#9123).

source: Исправлено (#9132).
en: Corrected (#9132).

source: Исправлено (#9140).
en: Corrected (#9140).

source: Исправлено (#9153).
en: Corrected (#9153).

source: Исправлено (#9171).
en: Corrected (#9171).

source: Исправлено (#9197).
en: Corrected (#9197).

source: Исправлены названия показателей моделей в отчетах по Линейной и Логистической регрессиям, добавлены недостающие показатели в Отчет по линейной регрессии, дополнены названия методов и факторов отбора моделей.
en: Names of models parameters were corrected in the Linear and Logistic regressions reports, missing parameters were added to the Linear regression report, names of methods and factors of models selection were added.

source: Исправлены обнаруженные ранее ошибки, повышена стабильность работы приложения, оптимизировано потребление оперативной памяти.
en: Earlier detected errors were corrected, operational stability of the application was increased, memory consumption was optimised.

source: Исправлены ошибки в Loginom Integrator, импортах из файловых источников, в узле Замена, а также в работе других обработчиков.
en: Errors in Loginom Integrator, import from file sources, Replace node and operation of other handlers were corrected.

source: Исправлены ошибки в инсталляторе Loginom Integrator, в ARIMAX и других компонентах.
en: Errors were corrected in Loginom Integrator, ARIMAX and other components.

source: Исправлены ошибки в нескольких Подключениях к источникам данных, в визуализаторах, в компонентах Калькулятор, Конечные классы, Дата и время, а также в компонентах, входящих в группы Импорт, Дерево данных, Программирование и Экспорт.
en: Errors were corrected in several Connections to data sources, visualizers, Calculator, Coarse classes, Date and time components and also in the components included into Import, Data tree, Programming and Export groups.

source: Исправлены ошибки в обработчиках Дерево в таблицу, Замена, Конечные классы, Квантование, Цикл и в визуализаторах Быстрый просмотр и Конечные классы.
en: The errors in Tree to table, Replace, Coarse сlasses, Binning, Loop handlers and in Quick view and Coarse сlasses visualizers were corrected.

source: Исправлены ошибки, появившиеся в Loginom 7.0.
en: The errors occurred in Loginom 7.0 were corrected.

source: Исправлены ошибки, связанные с некорректной индексацией строк, в результате которых при выполнении кода JavaScript могла возникать ошибка «Номер строки 0 вне диапазона [0; -1]» или некорректно отображаться набор данных в окне предварительного просмотра.
en: The errors connected with incorrect indexation of rows that can cause the following error while JavaScript code executing: "Row number 0 is out of [0; -1] range", or incorrect displaying of a data set in the preview window were corrected.

source: Исправлены ошибки:
en: The following errors were corrected:

source: К MS Excel нельзя подключиться как к базе данных из-за отсутствия драйверов под Linux.
en: It is not possible to connect to MS Excel as to database because there is no software driver for Linux.

source: К таким ошибкам относятся: «Ошибка подключения к 1С ...», «Ошибка подготовки запроса 1С ...», «Ошибка выполнения запроса 1С ...», «Ошибка подготовки полей запроса 1С ...», «Ошибка выгрузки результатов запроса 1С ...».
en: Such typical errors are as follows: "1C connection error ...", "Error preparing 1C request ...", "Error executing 1C request ...", "Error preparing 1C request fields ...", "Error of 1C request results loading ...".

source: Как следствие, при запросе через Интегратор возникала ошибка «Недопустимое количество столбцов во входной матрице значений...».
en: As a consequence, the following error occurred when requesting via Integrator: "Invalid column count in the input matrix of values...".

source: Калибровка модели при помощи поправки на априорную вероятность позволяет скорректировать искажения, которые могут вноситься на этапе построения модели при балансировке классов.
en: The model calibration using the priori probability correction enables to correct distortions that can occur at the model training stage when balancing the classes.

source: Калькулятор
en: Calculator

source: Качество бинарной классификации
en: Binary Classification Assessment

source: Кластеризация
en: Clustering

source: Кнопка свернуть в подмодель теперь активна даже если выбран один узел и этот узел не подмодель.
en: Collapse to supernode button is active now even if one node is selected and this node is not supernode.

source: Код, вызываемый в компоненте Python выполняется в один поток, а одновременно может выполняться только один узел Python.
en: The code called in the Python component is executed in a single thread, and only one Python node can be simultaneously executed.

source: Кодировка лог-файлов заменена на UTF8.
en: Log files encoding was replaced with UTF8.

source: Компонент Экспорт в Хранилище данных, а также механизм наследования для компонента Импорт из Хранилища данных.
en: Export to the Data Warehouse component and inheritance mechanism for Import from Data Warehouse component.

source: Компонент, способный существенно упростить аналитику первые этапы в работе с качеством данных.
en: The component that can significantly simplify analytics, the first stages of work with Data quality.

source: Компоненты на панели Производные компоненты теперь группируются по пакетам, внутри которых они содержатся.
en: The components of the Derived Components panel are currently grouped by the packages into which they are included.

source: Конвертация будет выполнена автоматически при открытии таких пакетов, а после обновления их нужно будет пересохранить.
en: Conversion will be automatically performed when opening such packages. It is required to save them after update once again.

source: Конвертация пакетов более ранних версий в формат 6.5
en: Conversion of the earlier version packages to 6.5 format

source: Конечные классы
en: Coarse Classes

source: Копирование в буфер обмена возможно только при подключении по протоколу https.
en: It is possible to copy to the clipboard only when connecting via https protocol.

source: Корректное значение параметра – app/ws/ (#8544).
en: The correct paramater value is app/ws/ (#8544).

source: Корректные значения доверительных интервалов появлялись в порту "Коэффициенты регрессионной модели" после повторного запуска узла.
en: Correct values of confidence intervals appeared in "Regression model coefficients" after the repeated node start.

source: Корреляция
en: Correlation

source: Кроме названия узла с GUID реализован вывод ещё и имени пакета при логировании сообщения об ошибке (#9176).
en: Apart from the node name with GUID, the package name is also currently shown when logging an error message (#9176).

source: Кроме того, название опции изменилось на "NOCASE в режиме UNICODE" (#9340).
en: Besides, the option name was changed to "NOCASE in UNICODE mode" (#9340).

source: Кроме того, отображаемые на графике ряды можно активировать и деактивировать.
en: Besides, the series shown in the graph can be activated and deactivated.

source: Кроме того, производительность выше при подключении по UDS как на Linux, так и на Windows.
en: Besides, performance is higher when connecting via UDS both for Linux, and for Windows.

source: Кросс-таблица
en: Cross Table

source: Крупное обновление аналитической платформы Loginom.
en: Major Update of Loginom Analytical Platform

source: Куб
en: Cube

source: Линейная и логистическая регрессии
en: Linear and Logistic Regressions

source: Линейная регрессия
en: Linear Regression

source: Логи с уровнем Warn и выше пишутся в stderr, а остальные — в stdout.
en: Logs with Warn level and higher are written in stderr, whereas the other ones in stdout.

source: Логика формирования имен полей:
en: Logics of fields names generation:

source: Логин и пароль для входа в Loginom теперь можно передать в URL.
en: Loginom login and password can be transferred in URL now.

source: Логирование
en: Logging

source: Логируемые сообщения о подключении/отключении от сервера и т.п.
en: Logged server connection/disconnection messages, etc.

source: Логистическая регрессия
en: Logistic Regression

source: Любой, кто занимался анализом данных знает, что работа по улучшению качества данных — одна из самых важных задач.
en: Everyone who deals with data analysis is aware of the fact that data quality improvement is one the most important tasks.

source: Мастер вызывается кнопкой с панели инструментов Куба и через соответствующий пункт контекстного меню.
en: The wizard is called using the button from the Cube Toolbar and corresponding context menu item.

source: Мастер настройки импорта из базы данных полностью переработан.
en: Import from database wizard was completely modified.

source: Масштабное обновление аналитической платформы Loginom.
en: Large-Scale Update of Loginom Analytical Platform

source: Механизм блокировки был сделан более надежным.
en: The locking mechanism became more reliable.

source: Минимальная поддерживаемая версия docker 20.10.0.
en: The minimum supported version of docker 20.10.0.

source: Минимальная поддерживаемая версия ядра Linux 5.3.
en: The minimum supported version of Linux 5.3 core

source: Минимальные требования: Windows 10, Windows Server 2019.
en: Minimum requirements: Windows 10, Windows Server 2019.

source: Модальное окно закрывается по щелчку за его пределами.
en: The modal window is closed on click beyond its limits.

source: Модуля узла Подмодель скрыт пункт меню «Настройка модификатора доступа» и «Свойства» (#6127, #7291.
en: "Configure visibility" and "Properties" menu item is hidden for the Supernode node module(#6127, #7291.

source: Может измениться результат работы сценария, если данные, возвращаемые ранее неактивными узлами JavaScript и Python, задействованы в следующих узлах сценария.
en: The workflow operation result can be changed if the data returned by the earlier inactive JavaScript and Python nodes were used in the next workflow nodes.

source: Мониторинг активных пользователей и занятых пакетов.
en: Monitoring of active users and busy packages.

source: На домашней странице добавлена возможность открыть в новом окне пакет из списка «Последние открытые пакеты».
en: It became possible to open the package from the "Recent opened packages" list on the homepage.

source: На первом этапе настраивается подключение, а затем в сценарии используются узлы на основе компонентов импорт или экспорт Kafka.
en: Connection is configured at the first stage, and then the nodes based on Kafka import or export components are used.

source: На странице Администрирование Loginom предусмотрен соответствующие настраиваемый параметр.
en: Corresponding configurable parameter is provided on Loginom Administration page.

source: На странице Отчеты появилась возможность создавать в группах подгруппы любой степени вложенности.
en: It became possible to create subgroups of any nesting level in groups on Reports page.

source: На странице Переменные пакета стала доступна панель Навигация.
en: On Package variables page Navigation bar became available.

source: На этой же странице можно добавить или обновить публикацию веб-сервиса, отредактировать опубликованный пакет или отменить публикацию.
en: It is possible to add or update the web service publication, edit the published package or cancel the publication on this page.

source: На этой странице отображается список опубликованных пакетов, имя и путь к файлу пакета, дата публикации, версия и статус автообновления.
en: List of all published packages, name and path to the package file, publication date, versions and auto update status are displayed on this page.

source: Нажатие на кнопку «Применить» не срабатывало, значения переменных не изменялись (#8987).
en: Pressing on "Apply" button was ineffective, variables values were not changed (#8987).

source: Название показателя «Максимум функции правдоподобия» в отчёте по линейной регрессии заменено на «Логарифм функции правдоподобия», а название показателя «P-значение (модель)» заменено на «P-значение модели».
en: "Likelihood maximum" parameter name in the linear regression report was replaced with "Log-likelihood", and "P-value (model)" parameter name was replaced with "Model P-value".

source: Например, в строке «Год+Квартал» шаблон %Y-Q%Q после клика на строку «Год+Месяц» заменялся на %Y-M%m.
en: For example, %Y-Q%Q template in "Year+Quarter" row was replaced with %Y-M%m after clicking on "Year+Month" row.

source: Например, если Loginom Integrator развёрнут по адресу: http://localhost/lgi, и атрибут urlPathPrefix не указан, то help-страница для REST доступна по адресу: http://localhost/lgi/rest/help.
en: For example, if Loginom Integrator is used at the following address: http://localhost/lgi, and urlPathPrefix attribute is not specified, help page for REST is available at the following address: http://localhost/lgi/rest/help.

source: Например, если было выбрано условие «первый день от текущей даты» (#8633).
en: For example, if "the first day from the current date" was selected (#8633).

source: Например, если опубликовано два пакета, в которых есть опубликованная подмодель с одним и тем же именем, а узел SOAP-запрос первоначально настроенный на операцию службы из первого пакета, перенастраивается на ту же самую операцию из второго пакета.
en: For example, if two packages are published with the published supernode inside them with one and the same name, and the SOAP request node initially configured to the service operation from the first package is reconfigured to the same operation from the second package.

source: Например, если сценарий, содержащий большое количество импортов из LGD-файлов, выполнялся в пакетном режиме, то при возникновении подобной ошибки сценарий не выполнялся, а служба LoginomServer останавливалась (#8363, #8367).
en: For example, if the workflow with many cases of import from LGD files was executed in the package mode, the workflow was not executed if such error occurred, and LoginomServer service was stopped (#8363, #8367).

source: Например, если Имя таблицы первоначально определить через Переменную 1, сохранить настройки, а затем открыть мастер и задать Имя таблицы через Переменную 2, то после сохранения и повторного открытия мастера настройки узла Имя таблицы было определено через Переменную 1, вместо ожидаемой Переменной 2.
en: For example, if Table name was initially defined via Variable 1 saving the settings, and then wizard was opened and Table name was set via Variable 2, Table name was defined via Variable 1 instead of the expected Variable 2 after saving and repeated opening of the wizard node.

source: Например, когда речь идет о создании систем принятия решений практически весь функционал базируется на обращении к веб-сервисам.
en: For example, when creation of decision-making system is meant, almost the whole functionality is based on the web services access.

source: Например, могли отсутствовать ожидаемые на выходе данные, соответствующие выбранным условиям (#8440).
en: For example, there could be no filtered data expected at the output (#8440).

source: Например, на серверной редакции Standard есть возможность выполнять SOAP-запросы, а в настольной редакции Personal такой опции нет.
en: For example, it is possible to execute the SOAP requests in the server Standard edition, whereas there is no such option in the desktop Personal edition.

source: Например, при конвертации пакета из старой версии в новую прирост производительности составляет до 1.3 раза.
en: For example, when converting the package from the old version to the new one, performance is increased by 1.3 times.

source: Например, при разборе ответа от веб-сервиса.
en: For example, when analyzing the web service response.
